### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [2]:
# Determine the total number of players
total_players = purchase_data.groupby(["SN"]).count().shape[0]
total_players

576

In [3]:
# Put the total number of players in a table
total_players_table = pd.DataFrame({"Total Players": [total_players]})
total_players_table

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [4]:
# Determine the number of unique items in the data
num_unique_items = purchase_data.groupby(["Item ID"]).count().shape[0]
num_unique_items

183

In [5]:
# Determine Number of Purchases
num_purchases = purchase_data["Price"].shape[0]
num_purchases

780

In [6]:
# Determine Total Revenue
total_revenue = purchase_data["Price"].sum()
total_revenue

2379.77

In [7]:
# Determine Average Price
ave_price = total_revenue / num_purchases
ave_price

3.0509871794871795

In [8]:
# Create Summary Table with the above data
summary_table = pd.DataFrame({"Number of Unique Items": [num_unique_items],
                              "Average Price": [ave_price],
                              "Number of Purchases": [num_purchases],
                              "Total Revenue": [total_revenue] 
                             })

# Format the currency items before displaying the table
summary_table["Average Price"] = summary_table["Average Price"].map("${:.2f}".format)
summary_table["Total Revenue"] = summary_table["Total Revenue"].map("${:,.2f}".format)

# Display the table
summary_table

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [9]:
# Create DataFrame grouped by SN and Gender
sn_gender_df = purchase_data.groupby( ["SN", "Gender"] ).count()

# Create unformated gendere count tabe
gender_count_df = sn_gender_df.groupby(["Gender"]).size()
gender_count_df

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
dtype: int64

In [10]:
total_players

576

In [11]:
# Capture gender counts for use later
num_females = gender_count_df.iloc[0]
num_males = gender_count_df.iloc[1]
num_others = gender_count_df.iloc[2]
print(num_females)
print(num_males)
print(num_others)

81
484
11

In [12]:
# Create clean table showing total count for each gender category
gender_count2_df = pd.DataFrame(sn_gender_df.groupby(["Gender"]).size())
renamed_gender_count_df = gender_count2_df.rename(columns={0:"Total Count"})

#sort dataframe by Total Count in decreasing values
gender_df = renamed_gender_count_df.sort_values("Total Count", ascending=False)

#Delete the index header (Gender)
del gender_df.index.name

# Calculate the percentages for each gender category and format the number as a percentage
gender_df["Percentage of Players"] = (gender_df["Total Count"] / total_players)* 100
gender_df["Percentage of Players"] = gender_df["Percentage of Players"].map("{:.2f}%".format)

# Display teh Gender Summary Info table
gender_df

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [13]:
# Calculate the number of purchases made by each of the gender categories
num_purchases_females = purchase_data.loc[purchase_data["Gender"] == "Female", :]["Purchase ID"].count()
num_purchases_males = purchase_data.loc[purchase_data["Gender"] == "Male", :]["Purchase ID"].count()
num_purchases_others = purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed", :]["Purchase ID"].count()
print(num_purchases_females)
print(num_purchases_males)
print(num_purchases_others)

113
652
15

In [14]:
# Calculate the average purchase price for each of the gender categories
ave_purchase_price_females = purchase_data.loc[purchase_data["Gender"] == "Female", :]["Price"].mean()
ave_purchase_price_males = purchase_data.loc[purchase_data["Gender"] == "Male", :]["Price"].mean()
ave_purchase_price_others = purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed", :]["Price"].mean()
print(ave_purchase_price_females)
print(ave_purchase_price_males)
print(ave_purchase_price_others)

3.203008849557519
3.0178527607361953
3.3460000000000005

In [15]:
# Calculate the total purchase value for each gender category
# Create a DataFrame grouped by gender that sums valuesfor each gender category
grouped_players_df = purchase_data.groupby(["Gender"]).sum()

# Capture and store the value for each gender category
total_purchase_value_females = grouped_players_df["Price"][0]
total_purchase_value_males = grouped_players_df["Price"][1]
total_purchase_value_others = grouped_players_df["Price"][2]

print(total_purchase_value_females)
print(total_purchase_value_males)
print(total_purchase_value_others)

361.93999999999966
1967.6399999999994
50.190000000000005

In [16]:
# Calculate the average total purchase for each gender category
avg_total_purchase_per_person_females = total_purchase_value_females / num_females
avg_total_purchase_per_person_males = total_purchase_value_males / num_males
avg_total_purchase_per_person_others = total_purchase_value_others / num_others

print(avg_total_purchase_per_person_females)
print(avg_total_purchase_per_person_males)
print(avg_total_purchase_per_person_others)

4.4683950617283905
4.065371900826445
4.562727272727273

In [17]:
# Create arrays (lists) with the values for each column in the gender info summary table
purchase_count_arr = [num_purchases_females, num_purchases_males, num_purchases_others]
ave_purchase_price_arr = [ave_purchase_price_females, ave_purchase_price_males, ave_purchase_price_others]
total_purchase_value_arr = [total_purchase_value_females, total_purchase_value_males, total_purchase_value_others]
avg_total_purchase_per_person_arr = [avg_total_purchase_per_person_females, 
                                     avg_total_purchase_per_person_males, 
                                     avg_total_purchase_per_person_others]

print(purchase_count_arr)
print(ave_purchase_price_arr)
print(total_purchase_value_arr)
print(avg_total_purchase_per_person_arr)

[113, 652, 15]
[3.203008849557519, 3.0178527607361953, 3.3460000000000005]
[361.93999999999966, 1967.6399999999994, 50.190000000000005]
[4.4683950617283905, 4.065371900826445, 4.562727272727273]

In [18]:
# Create the gender info summary table
purchase_analysis_table = pd.DataFrame({"Gender": ["Female", "Male", "Other / Non-Disclosed"], 
                                        "Purchase Count": purchase_count_arr, 
                                        "Average Purchase Price": ave_purchase_price_arr, 
                                        "Total Purchase Value": total_purchase_value_arr, 
                                        "Avg Total Purchase per Person": avg_total_purchase_per_person_arr
                                       })

# Format the currency values
purchase_analysis_table["Average Purchase Price"] = purchase_analysis_table["Average Purchase Price"].map("${:.2f}".format)
purchase_analysis_table["Total Purchase Value"] = purchase_analysis_table["Total Purchase Value"].map("${:,.2f}".format)
purchase_analysis_table["Avg Total Purchase per Person"] = purchase_analysis_table["Avg Total Purchase per Person"].map("${:,.2f}".format)

# Display the table
purchase_analysis_table.set_index("Gender", inplace=True)
purchase_analysis_table

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [19]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [20]:
# Show the total number of purchases
print(f"There are {purchase_data.shape[0]} purchases.")

There are 780 purchases.

In [21]:
purchase_data.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [22]:
# Create the bins in which Data will be held
bins = [0, 10, 15, 20, 25, 30, 35, 40, 100]

# Create the labels for the bins
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [23]:
unique_sn_data = purchase_data.drop_duplicates(subset='SN')

unique_sn_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [24]:
# Show the number of unique players (SN)
print(f"There are {unique_sn_data.shape[0]} unique players.")

There are 576 unique players.

In [25]:
# Get the ages of the unique players
sn_age_only_df = unique_sn_data.loc[:, ["Age"]]

# Convert the Age to a number
sn_age_only_df["Age"] = pd.to_numeric(sn_age_only_df["Age"])

# Display the table of ages
sn_age_only_df.head()

   Age
0   20
1   40
2   24
3   24
4   23

In [26]:
# Get total counts for the defined age bins
sn_age_only_df["Age Summary"] = pd.cut(sn_age_only_df["Age"], bins, labels=group_labels, right=False)
sn_age_only_df = sn_age_only_df.groupby("Age Summary").count()
age_only_df = sn_age_only_df.rename(columns={"Age":"Total Count"})

# Remove the header for the index column (age ranges)
del age_only_df.index.name

# Display the total counts of players in each age range
age_only_df

       Total Count
<10             17
10-14           22
15-19          107
20-24          258
25-29           77
30-34           52
35-39           31
40+             12

In [27]:
# Calculate and add a column to the table showing the Percentage of players for each age range
age_only_df["Percentage of Players"] = (age_only_df["Total Count"] / total_players)* 100

# Format the column as a percentage with 2 places to the right of the decimal point
age_only_df["Percentage of Players"] = age_only_df["Percentage of Players"].map("{:.2f}%".format)
age_only_df["Percentage of Players"]

# Show the formated table
age_only_df

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [28]:
purchase_data.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [29]:
# Create new DF with Age, Purchase ID and Price for the price info
purchase_price_only_df = purchase_data.loc[:, ["Age", "Purchase ID", "Price"]]

# Convert the Age to a number
purchase_price_only_df["Age"] = pd.to_numeric(purchase_price_only_df["Age"])

# Display the table (first 5 rows)
purchase_price_only_df.head()

   Age  Purchase ID  Price
0   20            0   3.53
1   40            1   1.56
2   24            2   4.88
3   24            3   3.27
4   23            4   1.44

In [30]:
# Show the number of rows of data in this table
print(f"There are {purchase_price_only_df.shape[0]} rows in the purchase_price_only_df DF.")

There are 780 rows in the purchase_price_only_df DF.

In [31]:
# Calculate the total purchase value for each age category
purchase_price_only_df["Age Summary"] = pd.cut(purchase_price_only_df["Age"], bins, labels=group_labels, right=False)
purchase_price_only_df = purchase_price_only_df.groupby("Age Summary").sum()

# Rename the Price column to show that is now the Total Purchase Value
purchase_price_only_df = purchase_price_only_df.rename(columns={"Price":"Total Purchase Value"})

# Display the table/DF
age_total_purchase_value = purchase_price_only_df[["Total Purchase Value"]]
age_total_purchase_value

             Total Purchase Value
Age Summary
<10                         77.13
10-14                       82.78
15-19                      412.89
20-24                     1114.06
25-29                      293.00
30-34                      214.00
35-39                      147.67
40+                         38.24

In [32]:
# Create new DF with Age, Purchase ID and Price for the count info
purchase_price_count_df = purchase_data.loc[:, ["Age", "Purchase ID", "Price"]]

# Convert the Age to a number
purchase_price_count_df["Age"] = pd.to_numeric(purchase_price_count_df["Age"])

# Display the table (first 5 rows)
purchase_price_count_df.head()

   Age  Purchase ID  Price
0   20            0   3.53
1   40            1   1.56
2   24            2   4.88
3   24            3   3.27
4   23            4   1.44

In [33]:
# Calculate the total purchase value for each age category
purchase_price_count_df["Age Summary"] = pd.cut(purchase_price_count_df["Age"], bins, labels=group_labels, right=False)
purchase_price_count_df = purchase_price_count_df.groupby("Age Summary").count()

# Rename the Price column to show that is now the Total Purchase Value
purchase_price_count_df = purchase_price_count_df.rename(columns={"Price":"Purchase Count"})

# Display the table/DF
age_purchase_count = purchase_price_count_df[["Purchase Count"]]
age_purchase_count

             Purchase Count
Age Summary
<10                      23
10-14                    28
15-19                   136
20-24                   365
25-29                   101
30-34                    73
35-39                    41
40+                      13

In [34]:
# Merge the Purchase Count and Total Purchase Value tables to create a table with both sets of data
merge_table = pd.merge(age_purchase_count, age_total_purchase_value, on="Age Summary")

# Convert the Total Purchase Value to an numeric value
merge_table["Total Purchase Value"] = pd.to_numeric(merge_table["Total Purchase Value"])

# Show the merged table
merge_table

             Purchase Count  Total Purchase Value
Age Summary
<10                      23                 77.13
10-14                    28                 82.78
15-19                   136                412.89
20-24                   365               1114.06
25-29                   101                293.00
30-34                    73                214.00
35-39                    41                147.67
40+                      13                 38.24

In [35]:
# Change the name of the Age Column to Total Count to reflect the values in this column.
age_only_df = sn_age_only_df.rename(columns={"Age":"Total Count"})

# Create new merge table to combine the first merge table with the Tota Count info from the age_only_df
merge_table2 = pd.merge(merge_table, age_only_df, on="Age Summary")

# Convert the Total Count, Total Purchase Value and Purchase Count to a number
merge_table2["Total Count"] = pd.to_numeric(merge_table2["Total Count"])
merge_table2["Total Purchase Value"] = pd.to_numeric(merge_table2["Total Purchase Value"])
merge_table2["Purchase Count"] = pd.to_numeric(merge_table2["Purchase Count"])

# Display the new, larger merged table
merge_table2

             Purchase Count  Total Purchase Value  Total Count
Age Summary
<10                      23                 77.13           17
10-14                    28                 82.78           22
15-19                   136                412.89          107
20-24                   365               1114.06          258
25-29                   101                293.00           77
30-34                    73                214.00           52
35-39                    41                147.67           31
40+                      13                 38.24           12

In [36]:
merge_table2[["Total Count"]]

             Total Count
Age Summary
<10                   17
10-14                 22
15-19                107
20-24                258
25-29                 77
30-34                 52
35-39                 31
40+                   12

In [37]:
#Calculate Average Purchase Price per Person as a new column in teh larger merged table
merge_table2["Average Purchase Price per Person"] = (merge_table2["Total Purchase Value"] / merge_table2["Total Count"])
merge_table2["Average Purchase Price"] = (merge_table2["Total Purchase Value"] / merge_table2["Purchase Count"])

# Format the currency columns
merge_table2["Average Purchase Price"] = merge_table2["Average Purchase Price"].map("${:.2f}".format)
merge_table2["Total Purchase Value"] = merge_table2["Total Purchase Value"].map("${:.2f}".format)
merge_table2["Average Purchase Price per Person"] = merge_table2["Average Purchase Price per Person"].map("${:.2f}".format)

# Reorder the age ranges so the "<10" is the last Row in teh table
merge_table2 = merge_table2.reindex(["10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+", "<10"])

# Display the resulting merged, formatted table
merge_table2

,Purchase Count,Total Purchase Value,Total Count,Average Purchase Price per Person,Average Purchase Price
Age Summary,,,,,
10-14,28,$82.78,22,$3.76,$2.96
15-19,136,$412.89,107,$3.86,$3.04
20-24,365,$1114.06,258,$4.32,$3.05
25-29,101,$293.00,77,$3.81,$2.90
30-34,73,$214.00,52,$4.12,$2.93
35-39,41,$147.67,31,$4.76,$3.60
40+,13,$38.24,12,$3.19,$2.94
<10,23,$77.13,17,$4.54,$3.35

In [38]:
# Reorder the columns as shown below
final_purchasing_analysis_age = merge_table2[["Purchase Count", 
                                             "Average Purchase Price", 
                                             "Total Purchase Value", "Average Purchase Price per Person"]]

# Reorder the age ranges so the "<10" is the last Row in teh table
final_purchasing_analysis_age = final_purchasing_analysis_age.reindex(["10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+", "<10"])

# Display the final Purchasing Analysis (Age) table
final_purchasing_analysis_age

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Price per Person
Age Summary,,,,
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,$1114.06,$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19
<10,23,$3.35,$77.13,$4.54

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [39]:
# Get a ubique list of players with a count of items
spender_df = purchase_data.groupby("SN").count()

# Create a table with only the Purchase Count column (and the index)
spender_purchase_count_df = spender_df[["Purchase ID"]]

# Rename the Purchase ID column to reflect the data which represents the Purchase Count
spender_purchase_count_df = spender_purchase_count_df.rename(columns={"Purchase ID":"Purchase Count"})

# Display the Purchase Count table
spender_purchase_count_df.head()

              Purchase Count
SN
Adairialis76               1
Adastirin33                1
Aeda94                     1
Aela59                     1
Aelaria33                  1

In [40]:
# Get a unique list of players with a sum of the columns
purchase_value_df = purchase_data.groupby("SN").sum()

# Extract the Price column and store it in a new table
spender_purchase_value_df = purchase_value_df[["Price"]]

# Rename the Price column to reflect the data which represents the Total Purchase Value
spender_purchase_value_df = spender_purchase_value_df.rename(columns={"Price":"Total Purchase Value"})

# Display the Total Purchase Value table
spender_purchase_value_df.head()

              Total Purchase Value
SN
Adairialis76                  2.28
Adastirin33                   4.48
Aeda94                        4.91
Aela59                        4.32
Aelaria33                     1.79

In [41]:
# Merge the Purchase Count table with the Total Purchase Value table
top_spenders_merge_table = pd.merge(spender_purchase_count_df, spender_purchase_value_df, on="SN")

# Convert the Purchase Count and Total Purchase Value to a number
top_spenders_merge_table["Purchase Count"] = pd.to_numeric(top_spenders_merge_table["Purchase Count"])
top_spenders_merge_table["Total Purchase Value"] = pd.to_numeric(top_spenders_merge_table["Total Purchase Value"])

# Display the merged tabe
top_spenders_merge_table.head()

              Purchase Count  Total Purchase Value
SN
Adairialis76               1                  2.28
Adastirin33                1                  4.48
Aeda94                     1                  4.91
Aela59                     1                  4.32
Aelaria33                  1                  1.79

In [42]:
# Calculate the Average Purchase Price for each player
top_spenders_merge_table["Average Purchase Price"] = (top_spenders_merge_table["Total Purchase Value"] / top_spenders_merge_table["Purchase Count"])

# Display the merged table
top_spenders_merge_table.head()

              Purchase Count  Total Purchase Value  Average Purchase Price
SN
Adairialis76               1                  2.28                    2.28
Adastirin33                1                  4.48                    4.48
Aeda94                     1                  4.91                    4.91
Aela59                     1                  4.32                    4.32
Aelaria33                  1                  1.79                    1.79

In [43]:
# Reorder the columns and store it in a new table
final_top_spenders_table = top_spenders_merge_table[["Purchase Count", "Average Purchase Price", "Total Purchase Value"]]

# Sort the table by the Total Purchase Value in a decending order
sorted_top_spenders = final_top_spenders_table.sort_values("Total Purchase Value", ascending=False)

# Format the two currency columns
sorted_top_spenders["Average Purchase Price"] = sorted_top_spenders["Average Purchase Price"].map("${:.2f}".format)
sorted_top_spenders["Total Purchase Value"] = sorted_top_spenders["Total Purchase Value"].map("${:.2f}".format)

# Display the new, sorted and formatted table
sorted_top_spenders.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [44]:
# List out the column names
purchase_data.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [45]:
popular_df = purchase_data.groupby("Item ID").count()
popular_count_df = popular_df[["Purchase ID"]]
popular_count_df = popular_count_df.rename(columns={"Purchase ID":"Purchase Count"})

popular_count_df.head()

         Purchase Count
Item ID
0                     4
1                     3
2                     6
3                     6
4                     5

In [46]:
item_name_table = purchase_data.loc[:, ["Item ID", "Item Name", "Price"]]
#item_name_table

unique_item_data = item_name_table.drop_duplicates(subset='Item ID')
#unique_item_data.reset_index()
unique_item_data.set_index("Item ID", inplace=True)

unique_item_data.head()

                                         Item Name  Price
Item ID
108      Extraction, Quickblade Of Trembling Hands   3.53
143                              Frenzied Scimitar   1.56
92                                    Final Critic   4.88
100                                    Blindscythe   3.27
131                                           Fury   1.44

In [47]:
popular_merge_table = pd.merge(popular_count_df, unique_item_data, on="Item ID")

# Convert the Age to a number
popular_merge_table["Purchase Count"] = pd.to_numeric(popular_merge_table["Purchase Count"])

popular_merge_table.head()

         Purchase Count           Item Name  Price
Item ID
0                     4            Splinter   1.28
1                     3            Crucifer   3.26
2                     6             Verdict   2.48
3                     6        Phantomlight   2.49
4                     5  Bloodlord's Fetish   1.70

In [48]:
popular_merge_table["Total Purchase Value"] = (popular_merge_table["Price"] * popular_merge_table["Purchase Count"])
popular_merge_table.head()

         Purchase Count           Item Name  Price  Total Purchase Value
Item ID
0                     4            Splinter   1.28                  5.12
1                     3            Crucifer   3.26                  9.78
2                     6             Verdict   2.48                 14.88
3                     6        Phantomlight   2.49                 14.94
4                     5  Bloodlord's Fetish   1.70                  8.50

In [49]:
final_popular_table = popular_merge_table[["Item Name", "Purchase Count", "Price", "Total Purchase Value"]]
final_popular_table = final_popular_table.rename(columns={"Price":"Item Price"})

sorted_popular_table = final_popular_table.sort_values("Purchase Count", ascending=False)
sorted_popular_table["Item Price"] = sorted_popular_table["Item Price"].map("${:.2f}".format)
sorted_popular_table["Total Purchase Value"] = sorted_popular_table["Total Purchase Value"].map("${:.2f}".format)

sorted_popular_table.head()

,Item Name,Purchase Count,Item Price,Total Purchase Value
Item ID,,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [50]:
# Sort the profitable table by Total Purchase Value in decending order
sorted_profitable_table = final_popular_table.sort_values("Total Purchase Value", ascending=False)

# Format the currancy columns
sorted_profitable_table["Item Price"] = sorted_profitable_table["Item Price"].map("${:.2f}".format)
sorted_profitable_table["Total Purchase Value"] = sorted_profitable_table["Total Purchase Value"].map("${:.2f}".format)

#Display the final, sorted, formated table
sorted_profitable_table.head()

,Item Name,Purchase Count,Item Price,Total Purchase Value
Item ID,,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80